#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kafka_stream.snowflake_procedure.kafka_stream will be created
  + resource "snowflake_procedure" "kafka_stream" {
      + comment             = "Stored proc that simulates a Kafka stream."
      + database            = "TERRAFORM_DEMO_PROD"
      + execute_as          = "CALLER"
      + handler             = "StreamDemo.run"
      + id                  = (known after apply)
      + language            = "JAVA"
      + name                = "SIMULATE_KAFKA_STREAM"
      + null_input_behavior = "RETURNS NULL ON NULL INPUT"
      + packages            = [
          + "com.snowflake:snowpark:1.8.0",
        ]
      + return_behavior     = "IMMUTABLE"
      + return_type         = "VARCHAR(16777216)"
      + schema              = "PUBLIC"
      + statement           = <<-EOT
            import com.snowflake.snowpark_java.Session;
            import java.io.*;
            import java.util.HashMap;
            public class StreamDemo {
                public String run(Session session, String mystage,String prefix,int numlines) {
                    SampleData SD=new SampleData();
                    BufferedWriter bw = null;
                    File f=null;
                    try {
                        f = File.createTempFile(prefix, ".json");
                        FileWriter fw = new FileWriter(f);
                        bw = new BufferedWriter(fw);
                        boolean first=true;
                        bw.write("[");
                        for(int i=1;i<=numlines;i++){
                            if (first) first = false;
                            else {bw.write(",");bw.newLine();}
                            bw.write(SD.getDataLine(i));
                        }
                        bw.write("]");
                        bw.close();
                        return session.file().put(f.getAbsolutePath(),mystage,options)[0].getStatus();
                    }
                    catch (Exception ex){
                        return ex.getMessage();
                    }
                    finally {
                        try{
                            if(bw!=null) bw.close();
                            if(f!=null && f.exists()) f.delete();
                        }
                        catch(Exception ex){
                            return ("Error in closing:  "+ex);
                        }
                    }
                }
            
                private static final HashMap<String,String> options = new HashMap<String, String>() {
                    { put("AUTO_COMPRESS", "TRUE"); }
                };
            
                // sample data generator (credit card transactions)
                public static class SampleData {
                    private static final java.util.Random R=new java.util.Random();
                    private static final java.text.NumberFormat NF_AMT = java.text.NumberFormat.getInstance();
                    String[] transactionType={"PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","PURCHASE","REFUND"};
                    String[] approved={"true","true","true","true","true","true","true","true","true","true","false"};
                    static {
                        NF_AMT.setMinimumFractionDigits(2);
                        NF_AMT.setMaximumFractionDigits(2);
                        NF_AMT.setGroupingUsed(false);
                    }
            
                    private static int randomQty(int low, int high){
                        return R.nextInt(high-low) + low;
                    }
            
                    private static double randomAmount(int low, int high){
                        return R.nextDouble()*(high-low) + low;
                    }
            
                    private String getDataLine(int rownum){
                        StringBuilder sb = new StringBuilder()
                            .append("{")
                            .append("\"element\":"+rownum+",")
                            .append("\"object\":\"basic-card\",")
                            .append("\"transaction\":{")
                            .append("\"id\":"+(1000000000 + R.nextInt(900000000))+",")
                            .append("\"type\":"+"\""+transactionType[R.nextInt(transactionType.length)]+"\",")
                            .append("\"amount\":"+NF_AMT.format(randomAmount(1,5000)) +",")
                            .append("\"currency\":"+"\"USD\",")
                            .append("\"timestamp\":\""+java.time.Instant.now()+"\",")
                            .append("\"approved\":"+approved[R.nextInt(approved.length)]+"")
                            .append("},")
                            .append("\"card\":{")
                                .append("\"number\":"+ java.lang.Math.abs(R.nextLong()) +"")
                            .append("},")
                            .append("\"merchant\":{")
                            .append("\"id\":"+(100000000 + R.nextInt(90000000))+"")
                            .append("}")
                            .append("}");
                        return sb.toString();
                    }
                }
            }
        EOT

      + arguments {
          + name = "mystage"
          + type = "VARCHAR"
        }
      + arguments {
          + name = "prefix"
          + type = "VARCHAR"
        }
      + arguments {
          + name = "numlines"
          + type = "NUMBER"
        }
    }

  # module.snowflake_resources.snowflake_database.tf_demo_database will be created
  + resource "snowflake_database" "tf_demo_database" {
      + data_retention_time_in_days = 1
      + id                          = (known after apply)
      + is_transient                = false
      + name                        = "TERRAFORM_DEMO_PROD"
    }

  # module.snowflake_resources.snowflake_database_grant.database_ro_grant will be created
  + resource "snowflake_database_grant" "database_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_object_parameter.o will be created
  + resource "snowflake_object_parameter" "o" {
      + id          = (known after apply)
      + key         = "DATA_RETENTION_TIME_IN_DAYS"
      + object_type = "DATABASE"
      + on_account  = false
      + value       = "30"

      + object_identifier {
          + name = "TERRAFORM_DEMO_PROD"
        }
    }

  # module.snowflake_resources.snowflake_role.tf_demo_reader_role will be created
  + resource "snowflake_role" "tf_demo_reader_role" {
      + comment = "Reader role for Terraform demo"
      + id      = (known after apply)
      + name    = "TF_DEMO_READER"
    }

  # module.snowflake_resources.snowflake_role_grants.tf_demo_reader_role_grant will be created
  + resource "snowflake_role_grants" "tf_demo_reader_role_grant" {
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + role_name              = "TF_DEMO_READER"
      + users                  = [
          + "TF_DEMO_READER",
        ]
    }

  # module.snowflake_resources.snowflake_schema.tf_demo_schema will be created
  + resource "snowflake_schema" "tf_demo_schema" {
      + data_retention_days = 1
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TF_DEMO"
    }

  # module.snowflake_resources.snowflake_schema_grant.schema_ro_grant will be created
  + resource "snowflake_schema_grant" "schema_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_stage.tf_demo_stage will be created
  + resource "snowflake_stage" "tf_demo_stage" {
      + aws_external_id    = (known after apply)
      + database           = "TERRAFORM_DEMO_PROD"
      + file_format        = "TYPE = JSON NULL_IF = [] COMPRESSION = auto STRIP_OUTER_ARRAY = true"
      + id                 = (known after apply)
      + name               = "VHOL_STAGE"
      + schema             = "TF_DEMO"
      + snowflake_iam_user = (known after apply)
    }

  # module.snowflake_resources.snowflake_stream.cc_landing_view_stream will be created
  + resource "snowflake_stream" "cc_landing_view_stream" {
      + append_only       = false
      + database          = "TERRAFORM_DEMO_PROD"
      + id                = (known after apply)
      + insert_only       = false
      + name              = "CC_TRANS_LANDING_VIEW_STREAM"
      + on_view           = "TERRAFORM_DEMO_PROD.TF_DEMO.CC_TRANS_LANDING_VIEW"
      + owner             = (known after apply)
      + schema            = "TF_DEMO"
      + show_initial_rows = false
    }

  # module.snowflake_resources.snowflake_table.cc_trans_all will be created
  + resource "snowflake_table" "cc_trans_all" {
      + change_tracking     = false
      + data_retention_days = 1
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + name                = "CC_TRANS_ALL"
      + owner               = (known after apply)
      + qualified_name      = (known after apply)
      + schema              = "TF_DEMO"

      + column {
          + name     = "CARD_ID"
          + nullable = true
          + type     = "VARCHAR"
        }
      + column {
          + name     = "MERCHANT_ID"
          + nullable = true
          + type     = "VARCHAR"
        }
      + column {
          + name     = "TRANSACTION_ID"
          + nullable = true
          + type     = "VARCHAR"
        }
      + column {
          + name     = "AMOUNT"
          + nullable = true
          + type     = "FLOAT"
        }
      + column {
          + name     = "CURRENCY"
          + nullable = true
          + type     = "VARCHAR"
        }
      + column {
          + name     = "APPROVED"
          + nullable = true
          + type     = "BOOLEAN"
        }
      + column {
          + name     = "TYPE"
          + nullable = true
          + type     = "VARCHAR"
        }
      + column {
          + name     = "TIMESTAMP"
          + nullable = true
          + type     = "TIMESTAMP_NTZ(9)"
        }
    }

  # module.snowflake_resources.snowflake_table.tf_demo_table will be created
  + resource "snowflake_table" "tf_demo_table" {
      + change_tracking     = true
      + data_retention_days = 1
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + name                = "CC_TRANS_LANDING"
      + owner               = (known after apply)
      + qualified_name      = (known after apply)
      + schema              = "TF_DEMO"

      + column {
          + name     = "RECORD_CONTENT"
          + nullable = true
          + type     = "VARIANT"
        }
    }

  # module.snowflake_resources.snowflake_table_grant.table_ro_grant will be created
  + resource "snowflake_table_grant" "table_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = true
      + on_future              = false
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_task.generate_task will be created
  + resource "snowflake_task" "generate_task" {
      + allow_overlapping_execution = false
      + comment                     = "Generates simulated real-time data for ingestion"
      + database                    = "TERRAFORM_DEMO_PROD"
      + enabled                     = true
      + id                          = (known after apply)
      + name                        = "GENERATE_TASK"
      + schedule                    = "1 minute"
      + schema                      = "TF_DEMO"
      + sql_statement               = "call SIMULATE_KAFKA_STREAM('@VHOL_STAGE','SNOW_',1000000)"
    }

  # module.snowflake_resources.snowflake_task.process_files_task will be created
  + resource "snowflake_task" "process_files_task" {
      + allow_overlapping_execution = false
      + comment                     = "Ingests Incoming Staging Datafiles into Staging Table"
      + database                    = "TERRAFORM_DEMO_PROD"
      + enabled                     = true
      + id                          = (known after apply)
      + name                        = "PROCESS_TASK"
      + schedule                    = "3 minute"
      + schema                      = "TF_DEMO"
      + sql_statement               = "copy into CC_TRANS_STAGING from @VHOL_STAGE PATTERN='.*SNOW_.*'"
    }

  # module.snowflake_resources.snowflake_task.refine_task will be created
  + resource "snowflake_task" "refine_task" {
      + allow_overlapping_execution = false
      + comment                     = "2.  ELT Process New Transactions in Landing/Staging Table into a more Normalized/Refined Table (flattens JSON payloads)"
      + database                    = "TERRAFORM_DEMO_PROD"
      + enabled                     = true
      + id                          = (known after apply)
      + name                        = "REFINE_TASK"
      + schedule                    = "4 minute"
      + schema                      = "TF_DEMO"
      + sql_statement               = <<-EOT
            insert into CC_TRANS_ALL (
              select                     
                card_id
                , merchant_id
                , transaction_id
                , amount
                , currency
                , approved
                , type
                , timestamp
            from CC_TRANS_STAGING_VIEW_STREAM)
        EOT
      + when                        = "SYSTEM$STREAM_HAS_DATA('CC_TRANS_STAGING_VIEW_STREAM')"
    }

  # module.snowflake_resources.snowflake_view.cc_trans_landing_view will be created
  + resource "snowflake_view" "cc_trans_landing_view" {
      + copy_grants = false
      + database    = "TERRAFORM_DEMO_PROD"
      + id          = (known after apply)
      + is_secure   = false
      + name        = "CC_TRANS_LANDING_VIEW"
      + or_replace  = false
      + schema      = "TF_DEMO"
      + statement   = <<-EOT
            select
              RECORD_CONTENT:card:number::varchar card_id,
              RECORD_CONTENT:merchant:id::varchar merchant_id,
              RECORD_CONTENT:transaction:id::varchar transaction_id,
              RECORD_CONTENT:transaction:amount::float amount,
              RECORD_CONTENT:transaction:currency::varchar currency,
              RECORD_CONTENT:transaction:approved::boolean approved,
              RECORD_CONTENT:transaction:type::varchar type,
              RECORD_CONTENT:transaction:timestamp::datetime timestamp
            from CC_TRANS_LANDING
        EOT
    }

  # module.snowflake_resources.snowflake_view_grant.view_ro_grant will be created
  + resource "snowflake_view_grant" "view_ro_grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = true
      + on_future              = false
      + privilege              = "SELECT"
      + roles                  = [
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_warehouse.task_warehouse will be created
  + resource "snowflake_warehouse" "task_warehouse" {
      + auto_resume                         = true
      + auto_suspend                        = 1
      + enable_query_acceleration           = false
      + id                                  = (known after apply)
      + max_cluster_count                   = (known after apply)
      + max_concurrency_level               = 8
      + min_cluster_count                   = (known after apply)
      + name                                = "VHOL_TASK_WAREHOUSE"
      + query_acceleration_max_scale_factor = 8
      + resource_monitor                    = (known after apply)
      + scaling_policy                      = (known after apply)
      + statement_queued_timeout_in_seconds = 0
      + statement_timeout_in_seconds        = 172800
      + warehouse_size                      = "MEDIUM"
      + warehouse_type                      = "STANDARD"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @sfc-gh-sekim, Action: `pull_request`*